# แบบฝึกหัด 2

---

จากข้อมูล titanic.csv ให้ทำการวิเคราะห์ข้อมูลเบื้องต้นเกี่ยวกับคอลัมน์ cabin  
โดยแผนภาพด้านล่างนี้เป็นตำแหน่งของ cabin ตามตัวอักษรตัวแรกของรหัส cabin ที่บันทึกในชุดข้อมูล

![titanic-cabin](https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Olympic_%26_Titanic_cutaway_diagram.png/800px-Olympic_%26_Titanic_cutaway_diagram.png)

ให้นิสิตสร้างคอลัมน์เพิ่ม โดยคอลัมน์ที่เพิ่มมานี้ จะเก็บข้อมูลของตัวอักษรตัวแรกที่ปรากฏในคอลัมน์ Cabin เช่น  
- หากในคอลัมน์ Cabin เป็นค่า "C123" ในคอลัมน์ที่สร้างจะบันทึก "C"  
- หากในคอลัมน์ Cabin เป็นค่า "C23 C25 C27" ในคอลัมน์ที่สร้างจะบันทึก "C"
- หากในคอลัมน์ Cabin เป็นค่า "B58 B60 C2" ในคอลัมน์ที่สร้างจะบันทึก "B"
- หากในคอลัมน์ Cabin เป็นค่า "F2" ในคอลัมน์ที่สร้างจะบันทึก "F"
- หากในคอลัมน์ Cabin เป็นค่า NaN ในคอลัมน์ที่สร้างจะบันทึก NaN

จากนั้นให้นิสิตเขียนโค้ดเพื่อตอบคำถามในแต่ละข้อ

In [1]:
# from google.colab import drive
# drive.mount('/content/drive')

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv("https://raw.githubusercontent.com/ThammakornS/ProgStat/main/dataset/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

นิสิตแสดงวิธีสร้างคอลัมน์

In [4]:
#your code
df['cabin_letter'] = df['Cabin'].str[0]

1. ในแต่ละตัวอักษร Cabin มีจำนวนผู้โดยสารกี่คน และมีจำนวน NaN เท่าไหร่

In [5]:
#your code
df['cabin_letter'].value_counts(dropna=False)

cabin_letter
NaN    687
C       59
B       47
D       33
E       32
A       15
F       13
G        4
T        1
Name: count, dtype: int64

2. ในแต่ละตัวอักษร Cabin มีจำนวนผู้โดยสารที่รอดและเสียชีวิตอย่างละเท่าไหร่ cabin ใดมีจำนวนผู้เสียชีวิตมากที่สุด

In [6]:
#your code
# 1. สร้างตารางแจกแจงจำนวนผู้รอด (1) และเสียชีวิต (0) ตามตัวอักษร Cabin
result = pd.crosstab(df['cabin_letter'], df['Survived'])
result

Survived       0   1
cabin_letter
A              8   7
B             12  35
C             24  35
D              8  25
E              8  24
F              5   8
G              2   2
T              1   0

In [7]:
result = df.groupby(['cabin_letter', 'Survived']).size().unstack(fill_value=0)
result

Survived       0   1
cabin_letter
A              8   7
B             12  35
C             24  35
D              8  25
E              8  24
F              5   8
G              2   2
T              1   0

In [8]:
# 2. หา Cabin ที่มีผู้เสียชีวิต (col 0) มากที่สุด
# เลือกคอลัมน์ 0 (เสียชีวิต) แล้วหา index ที่มีค่ามากที่สุด
most_deaths = result[0].idxmax()
count_deaths = result[0].max()

print(f"Cabin ที่มีผู้เสียชีวิตมากที่สุดคือ: {most_deaths} (จำนวน {count_deaths} คน)")

Cabin ที่มีผู้เสียชีวิตมากที่สุดคือ: C (จำนวน 24 คน)

3. cabin ใดมีค่า สัดส่วน จำนวนผู้รอดชีวิตหารด้วยจำนวนผู้เสียชีวิต สูงสุด

In [9]:
#your code
# คำนวณสัดส่วน (Ratio) = รอด / เสียชีวิต
survival_ratio = result[1] / result[0]

In [10]:
survival_ratio

cabin_letter
A    0.875000
B    2.916667
C    1.458333
D    3.125000
E    3.000000
F    1.600000
G    1.000000
T    0.000000
dtype: float64

In [11]:
max_cabin = survival_ratio.idxmax()
max_value = survival_ratio.max()

print(f"Cabin ที่มีสัดส่วน รอด/เสียชีวิต สูงที่สุดคือ: {max_cabin} (สัดส่วน {max_value:.2f})")

Cabin ที่มีสัดส่วน รอด/เสียชีวิต สูงที่สุดคือ: D (สัดส่วน 3.12)

4. cabin ใดมีค่าเฉลี่ยราคาตั๋ว (Fare) สูงสุด

In [12]:
#your code
# 1. หาค่าเฉลี่ยราคาตั๋วในแต่ละ Cabin
avg_fare = df.groupby('cabin_letter')['Fare'].mean()
avg_fare

cabin_letter
A     39.623887
B    113.505764
C    100.151341
D     57.244576
E     46.026694
F     18.696792
G     13.581250
T     35.500000
Name: Fare, dtype: float64

In [13]:
# 2. หา Cabin ที่มีราคาเฉลี่ยสูงสุด
max_cabin_fare = avg_fare.idxmax()
max_val_fare = avg_fare.max()

print(f"Cabin ที่มีค่าเฉลี่ยราคาตั๋วสูงสุดคือ: {max_cabin_fare} (เฉลี่ย {max_val_fare:.2f})")

Cabin ที่มีค่าเฉลี่ยราคาตั๋วสูงสุดคือ: B (เฉลี่ย 113.51)

5. จงแสดงค่าเฉลี่ยราคาตั๋ว (Fare) ของผู้รอดชีวิต และผู้เสียชีวิต ในแต่ละ cabin หากเปรียบเทียบราคาเฉลี่ยของผู้ที่รอดและเสียชีวิตจะพบว่า

In [14]:
# your code
fare_comparison = df.groupby(['cabin_letter', 'Survived'])['Fare'].mean().unstack()
fare_comparison

Survived              0           1
cabin_letter
A             35.496350   44.341071
B             57.137500  132.832026
C             99.972396  100.274046
D             53.770825   58.356176
E             43.715625   46.797050
F             11.340000   23.294787
G             10.462500   16.700000
T             35.500000         NaN

6. ในแต่ละอักษร cabin มีจำนวนผู้โดยสารแยกตาม Pclass อย่างละกี่คน

In [15]:
# your code
pd.crosstab(df['cabin_letter'], df['Pclass'])

Pclass         1  2  3
cabin_letter
A             15  0  0
B             47  0  0
C             59  0  0
D             29  4  0
E             25  4  3
F              0  8  5
G              0  0  4
T              1  0  0